In [1]:
import pandas as pd

columns = ['Name', 'Age', 'Height']
data = [
    ['Ted', 24, 177],
    ['Judy', 27, 183]
]

df = pd.DataFrame(data=data, columns=columns)
df

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

# Save as CSV

In [2]:
df.to_csv(r'./test_pandas.csv')

In [3]:
# 不儲存 index
df.to_csv(r'./test_pandas.csv', index=0)

In [4]:
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8')

In [5]:
# 不儲存欄位
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8', header=None)

In [6]:
# 若在 Excel 開啟 csv 出現亂碼，可使用 'utf-8-sig' 編碼
df.to_csv(r'./test_pandas.csv', index=0, encoding='utf-8-sig', header=None)

# Load CSV

In [7]:
df2 = pd.read_csv(r'./test_pandas.csv')
df2

    Ted  24  177
0  Judy  27  183

In [8]:
df2 = pd.read_csv(r'./test_pandas.csv', header=None)
df2

      0   1    2
0   Ted  24  177
1  Judy  27  183

In [9]:
df2.columns = ['Name', 'Age', 'Height']
df2

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

# Save as JSON

In [10]:
df.to_json('./test_pandas_default.json')

In [11]:
df.to_json('./test_pandas_columns.json', orient="columns")

In [12]:
df.to_json('./test_pandas_records.json', orient="records")

In [13]:
df.to_json('./test_pandas_index.json', orient="index")

In [14]:
df.to_json('./test_pandas_split.json', orient="split")

In [15]:
df.to_json('./test_pandas_table.json', orient="table")

# Read JSON

In [16]:
pd.read_json('./test_pandas_default.json')

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

In [17]:
pd.read_json('./test_pandas_columns.json', orient="columns")

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

In [18]:
pd.read_json('./test_pandas_records.json', orient="records")

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

In [19]:
pd.read_json('./test_pandas_index.json', orient="index")

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

In [20]:
pd.read_json('./test_pandas_split.json', orient="split")

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183

In [21]:
pd.read_json('./test_pandas_table.json', orient="table")

   Name  Age  Height
0   Ted   24     177
1  Judy   27     183